# 1.Create a data frame with 4 columns 4 rows

In [21]:
import pandas as pd
import numpy as n

In [25]:
d=[[44,55,45,11],[33,44,55,77],[56,88,33,66],[20,20,30,40]]
e=pd.DataFrame(d,index=["w","x","y","z"],columns=["a","b","c","d"])
e

    a   b   c   d
w  44  55  45  11
x  33  44  55  77
y  56  88  33  66
z  20  20  30  40

# 2.print all Columns form your data frame

In [26]:
e.columns()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [39]:
e.loc[:]

    a   b   c   d
w  44  55  45  11
x  33  44  55  77
y  56  88  33  66
z  20  20  30  40

# 3.print all rows from your data frame

In [43]:
e.loc[:,["a","b","c","d"]]

    a   b   c   d
w  44  55  45  11
x  33  44  55  77
y  56  88  33  66
z  20  20  30  40

# 4.print Second column in your data frame

In [65]:
e.loc[:,['b']]

    b
w  55
x  44
y  88
z  20

# 5.print last 2 columns from your data Frame

In [66]:
e.loc[:,['c','d']]

    c   d
w  45  11
x  55  77
y  33  66
z  30  40

# 6.print fourth row from your data Frame

In [68]:
e.loc[["z"]]

    a   b   c   d
z  20  20  30  40

# 7.print first 2 Rows from your data Frame

In [69]:
e.loc[["w","x"]]

    a   b   c   d
w  44  55  45  11
x  33  44  55  77

# 8.print all rows and first 2 columns from your data Frame

In [71]:
e.loc[:,['a','b']]

    a   b
w  44  55
x  33  44
y  56  88
z  20  20

# 9.Delete any row from your data Frame

In [88]:
e.drop("w")

    a   b  z
x  33  44  2
y  56  88  3
z  20  20  4

# 10.Delete any column from your data Frame

In [81]:
e.pop("c")

w    45
x    55
y    33
z    30
Name: c, dtype: int64

In [89]:
e

    a   b  z
w  44  55  1
x  33  44  2
y  56  88  3
z  20  20  4

# 11.Add a column to a Data Frame

In [94]:

s=[1,2,3,4]
e['z']=s
print(pd.DataFrame(e))

    a   b  z
w  44  55  1
x  33  44  2
y  56  88  3
z  20  20  4

# 12.Add a Row to Data Frame

In [121]:
new={'a':44,'b':99,'z':56}
s=pd.DataFrame(new,index=['q'])
e=pd.concat([s,e])
print(e)

    a   b   z
q  44  99  56
q  44  99  56
w  44  55   1
x  33  44   2
y  56  88   3
z  20  20   4

# 13.Iterate all Columns in your Data Frame and print result

In [123]:
for i in iter(e):
    print(i)

a
b
z

# 14.Iterate the 3rd column values of your Data frame and print result.

In [133]:
a=e.pop("z")
for i in iter(a):
    print(i)

56
56
1
2
3
4

# 15.Iterate all Rows in your Data Frame and print result.

In [135]:
for i in e.iterrows():
    print(i)

('q', a    44
b    99
Name: q, dtype: int64)
('q', a    44
b    99
Name: q, dtype: int64)
('w', a    44
b    55
Name: w, dtype: int64)
('x', a    33
b    44
Name: x, dtype: int64)
('y', a    56
b    88
Name: y, dtype: int64)
('z', a    20
b    20
Name: z, dtype: int64)

# 16.Read income.csv file and print as Data Frame

In [142]:
# read a csv file
file="income.csv"
import pandas as pd
d=pd.read_csv(file)
d

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

# 17.delete 2006 column info from your data Frame by using drop

In [143]:
d.drop(columns=["2006"])

,GEOID,State,2005,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55734,57014,56134,54283,53367,57020,57528